In [104]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

In [105]:
gdp = pd.read_csv("excel_cleaned/GDP in Millions of Dollars_clean.csv")
unemp_rate = pd.read_csv("excel_cleaned/Unemployment rate for age 20 years or over_clean.csv")

In [106]:
gdp.head()

   Year Quarter  GDP in millions
0  1948      Q1           265742
1  1948      Q2           272567
2  1948      Q3           279196
3  1948      Q4           280366
4  1949      Q1           275034

In [107]:
unemp_rate.head()

   Year Period  Value
0  1948    Q01    3.3
1  1948    Q02    3.3
2  1948    Q03    3.3
3  1948    Q04    3.4
4  1949    Q01    4.1

In [108]:
unemp_rate.loc[unemp_rate.Period == "Q01", "Period"] = "Q1"
unemp_rate.loc[unemp_rate.Period == "Q02", "Period"] = "Q2"
unemp_rate.loc[unemp_rate.Period == "Q03", "Period"] = "Q3"
unemp_rate.loc[unemp_rate.Period == "Q04", "Period"] = "Q4"

In [109]:
unemp_rate.head()

   Year Period  Value
0  1948     Q1    3.3
1  1948     Q2    3.3
2  1948     Q3    3.3
3  1948     Q4    3.4
4  1949     Q1    4.1

In [110]:
unemp_rate = unemp_rate.rename(columns = {
    "Year" : "Year",
    "Period" : "Quarter",
    "Value" : "Unemployment(%)"
})

In [111]:
unemp_rate["Period"] = unemp_rate["Year"].astype(str) + unemp_rate["Quarter"]

In [112]:
unemp_rate.head()

   Year Quarter  Unemployment(%)  Period
0  1948      Q1              3.3  1948Q1
1  1948      Q2              3.3  1948Q2
2  1948      Q3              3.3  1948Q3
3  1948      Q4              3.4  1948Q4
4  1949      Q1              4.1  1949Q1

In [113]:
unemp_rate = unemp_rate[["Period", "Unemployment(%)"]]

In [114]:
unemp_rate.head(10)

   Period  Unemployment(%)
0  1948Q1              3.3
1  1948Q2              3.3
2  1948Q3              3.3
3  1948Q4              3.4
4  1949Q1              4.1
5  1949Q2              5.3
6  1949Q3              6.1
7  1949Q4              6.4
8  1950Q1              5.8
9  1950Q2              5.1

In [115]:
gdp.head()

   Year Quarter  GDP in millions
0  1948      Q1           265742
1  1948      Q2           272567
2  1948      Q3           279196
3  1948      Q4           280366
4  1949      Q1           275034

In [116]:
gdp.head()

   Year Quarter  GDP in millions
0  1948      Q1           265742
1  1948      Q2           272567
2  1948      Q3           279196
3  1948      Q4           280366
4  1949      Q1           275034

In [117]:
gdp["Period"] = gdp["Year"].astype(str) + gdp["Quarter"]

In [118]:
gdp.head()

   Year Quarter  GDP in millions  Period
0  1948      Q1           265742  1948Q1
1  1948      Q2           272567  1948Q2
2  1948      Q3           279196  1948Q3
3  1948      Q4           280366  1948Q4
4  1949      Q1           275034  1949Q1

In [119]:
gdp = gdp.drop(columns = ["Year", "Quarter"])

In [120]:
gdp.head()

   GDP in millions  Period
0           265742  1948Q1
1           272567  1948Q2
2           279196  1948Q3
3           280366  1948Q4
4           275034  1949Q1

In [121]:
gdp = gdp[["Period", "GDP in millions"]]

In [122]:
gdp.head()

   Period  GDP in millions
0  1948Q1           265742
1  1948Q2           272567
2  1948Q3           279196
3  1948Q4           280366
4  1949Q1           275034

In [123]:
gdp['date_1'] = pd.to_datetime([
     '-'.join(x.split()[::-1]) for x in gdp['Period']])

In [124]:
gdp["Period"] = pd.to_datetime([
    "-".join(x.split()[::-1]) for x in gdp["Period"]])

In [125]:
gdp.head()

      Period  GDP in millions     date_1
0 1948-01-01           265742 1948-01-01
1 1948-04-01           272567 1948-04-01
2 1948-07-01           279196 1948-07-01
3 1948-10-01           280366 1948-10-01
4 1949-01-01           275034 1949-01-01

In [126]:
gdp = gdp.rename(columns = {"Period" : "date",})

In [127]:
gdp.head()

        date  GDP in millions     date_1
0 1948-01-01           265742 1948-01-01
1 1948-04-01           272567 1948-04-01
2 1948-07-01           279196 1948-07-01
3 1948-10-01           280366 1948-10-01
4 1949-01-01           275034 1949-01-01

In [128]:
unemp_rate.head()

   Period  Unemployment(%)
0  1948Q1              3.3
1  1948Q2              3.3
2  1948Q3              3.3
3  1948Q4              3.4
4  1949Q1              4.1

In [129]:
unemp_rate["date"] = pd.to_datetime([
    "-".join(x.split()[::-1]) for x in unemp_rate["Period"]])

In [130]:
unemp_rate = unemp_rate.drop(columns = {"Period"})

In [131]:
unemp_rate = unemp_rate.rename(columns = {
    "Unemployment(%)" : "unemployment_rate",
})

In [136]:
unemp_rate = unemp_rate[["date", "unemployment_rate"]]

In [137]:
unemp_rate.head()

        date  unemployment_rate
0 1948-01-01                3.3
1 1948-04-01                3.3
2 1948-07-01                3.3
3 1948-10-01                3.4
4 1949-01-01                4.1

In [138]:
gdp.head()

        date  GDP in millions     date_1
0 1948-01-01           265742 1948-01-01
1 1948-04-01           272567 1948-04-01
2 1948-07-01           279196 1948-07-01
3 1948-10-01           280366 1948-10-01
4 1949-01-01           275034 1949-01-01

In [139]:
gdp = gdp.rename(columns = {
    "GDP in millions" : "GDP_in_millions",
})

In [140]:
gdp.head()

        date  GDP_in_millions     date_1
0 1948-01-01           265742 1948-01-01
1 1948-04-01           272567 1948-04-01
2 1948-07-01           279196 1948-07-01
3 1948-10-01           280366 1948-10-01
4 1949-01-01           275034 1949-01-01

In [133]:
# gdp.to_csv("gdp_clean_model_data.csv")

In [134]:
# unemp_rate.to_csv("unemployment_rate_clean.csv")

In [142]:
gdp_unemployment = pd.merge(unemp_rate, gdp, on = "date")

In [143]:
gdp_unemployment.head()

        date  unemployment_rate  GDP_in_millions     date_1
0 1948-01-01                3.3           265742 1948-01-01
1 1948-04-01                3.3           272567 1948-04-01
2 1948-07-01                3.3           279196 1948-07-01
3 1948-10-01                3.4           280366 1948-10-01
4 1949-01-01                4.1           275034 1949-01-01

In [144]:
# gdp_unemployment.to_csv("GDP_Unemployment_model_data.csv")